/**
 * Created by dongming on 14-9-19.
 */

define(function(require, exports, module) {
    // 灾害事件
    exports.starEvent = ["你的文明爆发了战争", "你的文明爆发了瘟疫", "你的文明出现了自然灾害", "你的文明出现了资源匮乏"];
    // 时代说明
    exports.ageInfo = {
        "shiqi": {
            "age": 0,
            "name": "石器时代",
            "news":[
                '你的文明中母系氏族社会产生',
                '你的文明开始明确分工',
                '你的文明驯化了猪、狗',
                '你的文明掌握了培育玉米和苋的能力',
                '你的文明开始信仰自然之神',
                '你的文明创造出第一幅壁画',
                '你的文明看到了来自外星的飞船',
                '你的文明由于炎热开始向北方迁徙',
                '你的文明由于寒冷开始向南方迁徙',
                '你的文明开始信仰丰产女神'
            ]
        },
        "qingtong": {
            "age": 300 ,
            "name": "青铜时代",
            "news":[]
        },
        "heitie": {
            "age": 600,
            "name": "黑铁时代",
            "news":[]
        },
        "huoqi": {
            "age": 900,
            "name": "火器时代",
            "news":[]
        },
        "gongye": {
            "age": 1200,
            "name": "工业时代",
            "news":[]
        },
        "xinxi": {
            "age": 1500,
            "name": "信息时代",
            "news":[]
        },
        "taikong": {
            "age": 1800,
            "name": "太空时代",
            "news":[]
        }
    };

    exports.abilityDetail = {
        A: {
            name: '行星抗寒',
            description: '行星抗寒能提升行星在长时间过于远离恒星时的耐受力，使更多人民在严寒中得以存活。提升其可以大大降低自然灾害的发生率，轻微降低资源匮乏的发生率。',
            cnt: 5,
            cntDesc: '-5 文明点数'
        },
        B: {
            name: '行星抗热',
            description: '行星抗热能提升行星在长时间过于靠近恒星时的耐受力，使更多人民在酷热中得以存活。提升其可以大大降低自然灾害的发生率，轻微降低资源匮乏的发生率。',
            cnt: 5,
            cntDesc: '-5 文明点数'
        },
        C: {
            name: '轨道变更',
            description: '轨道变更可以让行星的轨迹变化更加灵活，更加灵巧的穿梭于恒星间，提升文明的存活几率。',
            cnt: 5,
            cntDesc: '-5 文明点数'
        },
        D: {
            name: '政治文化',
            description: '政治文化影响文明中人们的政治行为和心理因素。其有利于提升文明的道德标准与价值认同。提升其可以大大降低战争的发生率，少量降低瘟疫的发生率，轻微降低自然灾害的发生率。但当自然匮乏发生时会有更严重的后果。',
            cnt: 5,
            cntDesc: '-5 文明点数'
        },
        E: {
            name: '科学技术',
            description: '科学技术能力旨在提升行星文献名对科学技术的投入与禀赋。其目的是实现高效、便捷的文明。提升其可大大降低瘟疫的发病率，少量降低战争发生率，轻微降低自然匮乏发生率。但是会提升战争带来的负面影响。',
            cnt: 5,
            cntDesc: '-5 文明点数'
        },
        F: {
            name: '资源经济',
            description: '资源经济能力可以提升文明对经济与匮乏资源的探求。更合理的利用资源，提升文明财富。提升其可大大降低资源匮乏的发生率，轻微降低战争与瘟疫的发生率。但会提升自然灾害所带来的负面影响。',
            cnt: 5,
            cntDesc: '-5 文明点数'
        }
    }

});